examples/of7/kEpsilon/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{

    inlet
    {
        type            kABL;
        #include        "include/ABLConditions"
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
        value           $internalField;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    building
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }
    
    surroundings
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    #include "include/sideAndTopPatches"

    top
    {
        type fixedValue;

        #include        "include/ABLConditions"
        #include        "../system/blockMeshDict"

        topK #calc      "$C1*log($zMax+$z0) + $C2";
       
        value uniform $topK;
    }

}


// ************************************************************************* //
