examples/of7/kEpsilon/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

    ground
    {  
        type            nutRoughABLWallFunction;
        #include        "include/ABLConditions"
        value           uniform 0;
    }

    building
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.793;
        value           uniform 0;
    }

    surroundings
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.793;
        value           uniform 0;
    }

    #include "include/sideAndTopPatches"

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

}
// ************************************************************************* //
